benchmarks/20260808T173800Z/results/gemma-4-12b-it-NVFP4/gemma-4-12b-it-NVFP4__interactive__1.stdout.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76781c3efce0>, trust_remote_code=False, seed=0, num_prompts=10, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='unsloth/gemma-4-12b-it-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/gemma4-benchmark/results/gemma-4-12b-it-NVFP4', result_filename='gemma-4-12b-it-NVFP4__interactive__1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-77a204bd-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-08 17:04:49 [utils.py:90] Sampling input_len from [512, 512] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  47.72     
Total input tokens:                      5252      
Total generated tokens:                  5120      
Request throughput (req/s):              0.21      
Output token throughput (tok/s):         107.29    
Peak output token throughput (tok/s):    110.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          217.34    
---------------Time to First Token----------------
Mean TTFT (ms):                          46.57     
Median TTFT (ms):                        47.27     
P50 TTFT (ms):                           47.27     
P90 TTFT (ms):                           61.56     
P99 TTFT (ms):                           62.89     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.25      
Median TPOT (ms):                        9.20      
P50 TPOT (ms):                           9.20      
P90 TPOT (ms):                           9.36      
P99 TPOT (ms):                           9.37      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4772.12   
Median E2EL (ms):                        4757.76   
P50 E2EL (ms):                           4757.76   
P90 E2EL (ms):                           4823.70   
P99 E2EL (ms):                           4838.08   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/10 [00:00<?, ?it/s]
 10%|█         | 1/10 [00:04<00:42,  4.70s/it]
 20%|██        | 2/10 [00:09<00:37,  4.72s/it]
 30%|███       | 3/10 [00:14<00:33,  4.76s/it]
 40%|████      | 4/10 [00:19<00:28,  4.78s/it]
 50%|█████     | 5/10 [00:23<00:23,  4.79s/it]
 60%|██████    | 6/10 [00:28<00:19,  4.81s/it]
 70%|███████   | 7/10 [00:33<00:14,  4.79s/it]
 80%|████████  | 8/10 [00:38<00:09,  4.78s/it]
 90%|█████████ | 9/10 [00:42<00:04,  4.77s/it]
100%|██████████| 10/10 [00:47<00:00,  4.77s/it]
100%|██████████| 10/10 [00:47<00:00,  4.77s/it]